# Rounding Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalysisDisplayVectorSettings..::..Rounding Property
AnalysisDisplayVectorSettings Class See Also
---
Increment to which numeric values of analysis results are rounded in vectors.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2012
# Syntax
C#
---
```text
public double Rounding { get; set; }
```

Visual Basic
---
```text
Public Property Rounding As Double
	Get
	Set
```

Visual C++
---
```text
public:
property double Rounding {
	double get ();
	void set (double value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentsInconsistentException | When setting this property: rounding is not positive |

# See Also
AnalysisDisplayVectorSettings Class
Autodesk.Revit.DB.Analysis Namespace